<a href="https://colab.research.google.com/github/ava11235/it125/blob/main/week5_sorting_subsetting.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

### Subsetting and sorting DataFrames

The pandas package is used for importing data into Python, as well as for data manipulation and data visualization.  pandas was built on top of NumPy and Matplotlib.

In pandas rectangular, tabular data is represented as a DataFrame object with columns and rows. Every column has a textual or numeric data type. Different columns can have different data types.


### Summary of functions for exploring a panda dataframe:

``` .head() ```

Returns the first several rows of a dataframe. Can be very helpful if the dataframe has many rows.

``` .info() ```

Displays the names of columns, their data types and if they have any missing values.

``` .shape ``` 

This attribute (no parenthesis) displays the number of rows and the number of columns. 

``` .describe() ```

Computes summary statistics for numerical columns, such as  mean, median, and std. "count" displays the number of non-missing values in each column. 

``` .values ```

The values attribute displays the data values in a 2D NumPy array.

``` 
 .columns 
 .index 
 ```
The columns attribute contains column names, and the index attribute contains row numbers or row names. Note that  row labels are stored in dot-index rather than dot-rows. They are of type Index object.

In [ ]:
import pandas as pd

# import data into a dataframe object
df = pd.read_csv("https://raw.githubusercontent.com/ava11235/it125/main/datasets/wallmart_sales.csv")

df.head()

   Unnamed: 0  store type  ...  temperature_c fuel_price_usd_per_l  unemployment
0           0      1    A  ...       5.727778             0.679451         8.106
1           1      1    A  ...       8.055556             0.693452         8.106
2           2      1    A  ...      16.816667             0.718284         7.808
3           3      1    A  ...      22.527778             0.748928         7.808
4           4      1    A  ...      27.050000             0.714586         7.808

[5 rows x 10 columns]

In [ ]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10774 entries, 0 to 10773
Data columns (total 10 columns):
 #   Column                Non-Null Count  Dtype
---  ------                --------------  -----
 0   Unnamed: 0            10774 non-null  int64
 1   store                 10774 non-null  int64
 2   type                  10774 non-null  object
 3   department            10774 non-null  int64
 4   date                  10774 non-null  object
 5   weekly_sales          10774 non-null  float64
 6   is_holiday            10774 non-null  bool
 7   temperature_c         10774 non-null  float64
 8   fuel_price_usd_per_l  10774 non-null  float64
 9   unemployment          10774 non-null  float64
dtypes: bool(1), float64(4), int64(3), object(2)
memory usage: 768.2+ KB

In [ ]:
df.describe()

         Unnamed: 0         store  ...  fuel_price_usd_per_l  unemployment
count  10774.000000  10774.000000  ...          10774.000000  10774.000000
mean    5386.500000     15.441897  ...              0.749746      8.082009
std     3110.330234     11.534511  ...              0.059494      0.624355
min        0.000000      1.000000  ...              0.664129      3.879000
25%     2693.250000      4.000000  ...              0.708246      7.795000
50%     5386.500000     13.000000  ...              0.743381      8.099000
75%     8079.750000     20.000000  ...              0.781421      8.360000
max    10773.000000     39.000000  ...              1.107674      9.765000

[8 rows x 7 columns]

In [ ]:
df.values

array([[0, 1, 'A', ..., 5.727777777777778, 0.6794508388787476, 8.106],
       [1, 1, 'A', ..., 8.055555555555555, 0.6934519642522211, 8.106],
       [2, 1, 'A', ..., 16.81666666666667, 0.7182841488768721, 7.808],
       ...,
       [10771, 39, 'A', ..., 27.288888888888888, 0.911922354513778,
        6.989],
       [10772, 39, 'A', ..., 25.644444444444442, 0.8601446078496121,
        6.622999999999998],
       [10773, 39, 'A', ..., 22.25, 0.9555107636953459, 6.228]],
      dtype=object)

In [ ]:
df.columns

Index(['Unnamed: 0', 'store', 'type', 'department', 'date', 'weekly_sales',
       'is_holiday', 'temperature_c', 'fuel_price_usd_per_l', 'unemployment'],
      dtype='object')

In [ ]:
df.index

RangeIndex(start=0, stop=10774, step=1)

### Sorting 

Sorting a dataframe by rows can be in ascending or descending order. 
It is possible to sort by passing a list of column names.
A dataframe can be subset by passing one or multiple column names, in which case you need two pairs of [[ ]] square brackets.

Logical conditions, text or dates can be used to subset rows. Multiple conditions can be combined with the use of the logical operators.

```.isin() ```

To filter on multiple values of a categorical variables, the .isin() method can be used.

Sorting by rows can be accomplished by passing a column name to
``` 
.sort_values()```.

When rows In cases where rows have the same value, as for example with categorical variables, multiple columns can be used to break the ties.

In [ ]:
df.sort_values('weekly_sales', ascending=False)

      Unnamed: 0  store type  ...  temperature_c fuel_price_usd_per_l  unemployment
6201        6201     14    A  ...      -2.605556             0.735455         8.992
4271        4271     10    B  ...      12.411111             0.782478         9.765
4281        4281     10    B  ...      10.650000             0.803348         9.003
6202        6202     14    A  ...       2.850000             0.733606         8.992
6237        6237     14    A  ...      -2.605556             0.735455         8.992
...          ...    ...  ...  ...            ...                  ...           ...
517          517      1    A  ...      14.327778             0.704547         8.106
4110        4110     10    B  ...      13.288889             0.760023         9.765
4115        4115     10    B  ...      24.155556             0.813650         9.003
1422        1422      2    A  ...      18.777778             0.718548         8.163
1420        1420      2    A  ...      28.605556             0.697415         8.099

[10774 rows x 10 columns]

In [ ]:
df.sort_values(['weekly_sales'])  #ascending=True by default

      Unnamed: 0  store type  ...  temperature_c fuel_price_usd_per_l  unemployment
1420        1420      2    A  ...      28.605556             0.697415         8.099
1422        1422      2    A  ...      18.777778             0.718548         8.163
4115        4115     10    B  ...      24.155556             0.813650         9.003
4110        4110     10    B  ...      13.288889             0.760023         9.765
517          517      1    A  ...      14.327778             0.704547         8.106
...          ...    ...  ...  ...            ...                  ...           ...
6237        6237     14    A  ...      -2.605556             0.735455         8.992
6202        6202     14    A  ...       2.850000             0.733606         8.992
4281        4281     10    B  ...      10.650000             0.803348         9.003
4271        4271     10    B  ...      12.411111             0.782478         9.765
6201        6201     14    A  ...      -2.605556             0.735455         8.992

[10774 rows x 10 columns]

In [ ]:
# what are the top weekly sales?

#select only the column that you need
weekly_sales = df['weekly_sales']
weekly_sales.head()

0    24924.50
1    21827.90
2    57258.43
3    17413.94
4    17558.09
Name: weekly_sales, dtype: float64

In [ ]:
# how many weeks the sales were negative
neg_weekly_sales = df[df['weekly_sales'] < 0]
print(neg_weekly_sales['weekly_sales'].count())

108

In [ ]:
print(neg_weekly_sales['weekly_sales'].count())

108

Use relational operators to find subsets that match a certain criteria. Use logial operators to combine multiple conditions.

In [ ]:
# on how many holidays the weekly sales were negative?

df[(df['weekly_sales'] < 0) & (df['is_holiday'] == True)]

      Unnamed: 0  store type  ...  temperature_c fuel_price_usd_per_l  unemployment
6810        6810     19    A  ...      -1.861111             0.881278         8.067
7718        7718     20    A  ...      18.344444             0.713001         7.527
8072        8072     20    A  ...      24.644444             1.033177         7.280

[3 rows x 10 columns]

Subset rows with categorical variables.
Use the 
``` .isin() ``` 
to select rows with a speciried value(s).

In [ ]:
import seaborn as sns
tips_df = sns.load_dataset('tips')
tips_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 244 entries, 0 to 243
Data columns (total 7 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   total_bill  244 non-null    float64
 1   tip         244 non-null    float64
 2   sex         244 non-null    category
 3   smoker      244 non-null    category
 4   day         244 non-null    category
 5   time        244 non-null    category
 6   size        244 non-null    int64
dtypes: category(4), float64(2), int64(1)
memory usage: 7.3 KB

In [ ]:
titanic['day']

0       Sun
1       Sun
2       Sun
3       Sun
4       Sun
       ...
239     Sat
240     Sat
241     Sat
242     Sat
243    Thur
Name: day, Length: 244, dtype: category
Categories (4, object): ['Thur', 'Fri', 'Sat', 'Sun']

In [ ]:
weekday =['Thur']
condition = tips_df['day'].isin(weekday)
tips_df[condition]

     total_bill   tip     sex smoker   day    time  size
77        27.20  4.00    Male     No  Thur   Lunch     4
78        22.76  3.00    Male     No  Thur   Lunch     2
79        17.29  2.71    Male     No  Thur   Lunch     2
80        19.44  3.00    Male    Yes  Thur   Lunch     2
81        16.66  3.40    Male     No  Thur   Lunch     2
..          ...   ...     ...    ...   ...     ...   ...
202       13.00  2.00  Female    Yes  Thur   Lunch     2
203       16.40  2.50  Female    Yes  Thur   Lunch     2
204       20.53  4.00    Male    Yes  Thur   Lunch     4
205       16.47  3.23  Female    Yes  Thur   Lunch     3
243       18.78  3.00  Female     No  Thur  Dinner     2

[62 rows x 7 columns]